#### terraform plan every: d46def7
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_route_table.twitter_debug_subnet_rt: Refreshing state... [id=rtb-0fdb2b048c9f87655]
aws_subnet.twitter_db_subnet_1c: Refreshing state... [id=subnet-0b2f45ad03df0933c]
aws_subnet.twitter_db_subnet_1a: Refreshing state... [id=subnet-0216cb204304dceb1]
aws_security_group.free_security_db: Refreshing state... [id=sg-02e79fb55011f615b]
aws_kms_key.rds_storage: Refreshing state... [id=2fd6d9c5-2958-4009-8f6d-b7bea48dd622]
aws_security_group.all_free_security: Refreshing state... [id=sg-02a63935f4d0d26df]
aws_db_parameter_group.main: Refreshing state... [id=main]
aws_key_pair.mmm3: Refreshing state... [id=mmm3]
aws_eip.debug_ec2: Refreshing state... [id=eipalloc-057e436f4a236790f]
aws_iam_role.rds_monitoring_role: Refreshing state... [id=rds_monitoring_role]
aws_db_option_group.main: Refreshing state... [id=main]
aws_route.public_debug_twitter_db: Refreshing state... [id=r-rtb-0fdb2b048c9f876551080289494]
aws_route_table_association.public_debug_twitter_db_1c: Refreshing state... [id=rtbassoc-0481bca920079be95]
aws_instance.rds_debug_ec2_1: Refreshing state... [id=i-0c3f285bfc38f6030]
aws_route_table_association.public_debug_twitter_db_1a: Refreshing state... [id=rtbassoc-0bb6ad17d7accf0cd]
aws_db_subnet_group.main: Refreshing state... [id=db]
aws_iam_role_policy_attachment.default: Refreshing state... [id=rds_monitoring_role-20211214160957065600000001]
aws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-027835e8b18cbb986]
aws_db_instance.main: Refreshing state... [id=main]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_db_instance.main has changed
  ~ resource "aws_db_instance" "main" {
        id                                    = "main"
      ~ latest_restorable_time                = "2021-12-19T16:20:01Z" -> "2021-12-19T16:35:00Z"
        name                                  = "twitter_db"
        tags                                  = {
            "Env" = "dev"
        }
        # (49 unchanged attributes hidden)
    }

  # aws_eip.debug_ec2 has changed
  ~ resource "aws_eip" "debug_ec2" {
      - association_id       = "eipassoc-0b57d21ba01b64d8f" -> null
        id                   = "eipalloc-057e436f4a236790f"
      - instance             = "i-0692e0b8d2465201b" -> null
      - network_interface    = "eni-0d62d63535709e4c3" -> null
      - private_ip           = "10.0.4.165" -> null
        tags                 = {
            "Name" = "debug_ec2"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_eip_association.eip_assoc has been deleted
  - resource "aws_eip_association" "eip_assoc" {
      - allocation_id        = "eipalloc-057e436f4a236790f" -> null
      - id                   = "eipassoc-027835e8b18cbb986" -> null
      - instance_id          = "i-0c3f285bfc38f6030" -> null
      - network_interface_id = "eni-0d9fb3b9f78ef305c" -> null
      - private_ip_address   = "10.0.4.197" -> null
      - public_ip            = "18.178.206.27" -> null
    }

  # aws_instance.rds_debug_ec2_1 has been deleted
  - resource "aws_instance" "rds_debug_ec2_1" {
      - ami                                  = "ami-011facbea5ec0363b" -> null
      - arn                                  = "arn:aws:ec2:ap-northeast-1:554506578892:instance/i-0c3f285bfc38f6030" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-northeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0c3f285bfc38f6030" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "mmm3" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0d9fb3b9f78ef305c" -> null
      - private_dns                          = "ip-10-0-4-197.ap-northeast-1.compute.internal" -> null
      - private_ip                           = "10.0.4.197" -> null
      - public_dns                           = "ec2-175-41-226-192.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "175.41.226.192" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0b2f45ad03df0933c" -> null
      - tags                                 = {
          - "Name" = "rds_debug_ec2_1"
        } -> null
      - tags_all                             = {
          - "Name" = "rds_debug_ec2_1"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-02a63935f4d0d26df",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - snapshot_id           = "snap-0ffc2bf377f23be03" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-00c17f4662e4c9b8a" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-00c17f4662e4c9b8a" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp2" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.redash_eip will be created
  + resource "aws_eip" "redash_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "debug_ec2"
        }
      + tags_all             = {
          + "Name" = "debug_ec2"
        }
      + vpc                  = true
    }

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = "eipalloc-057e436f4a236790f"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_eip_association.eip_assoc_redash will be created
  + resource "aws_eip_association" "eip_assoc_redash" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.rds_debug_ec2_1 will be created
  + resource "aws_instance" "rds_debug_ec2_1" {
      + ami                                  = "ami-011facbea5ec0363b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mmm3"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0b2f45ad03df0933c"
      + tags                                 = {
          + "Name" = "rds_debug_ec2_1"
        }
      + tags_all                             = {
          + "Name" = "rds_debug_ec2_1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-02a63935f4d0d26df",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.rds_redash will be created
  + resource "aws_instance" "rds_redash" {
      + ami                                  = "ami-060741a96307668be"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "mmm3"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0b2f45ad03df0933c"
      + tags                                 = {
          + "Name" = "rds_debug_ec2_1"
        }
      + tags_all                             = {
          + "Name" = "rds_debug_ec2_1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-02a63935f4d0d26df",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "/dev/xvda"
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp2"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Plan Error</summary>

```terraform

```

</details>


*Pusher: @lazmond3, Action: `pull_request`*